Here's an example of me applying this module to a brand new account:

```text
circleci@ebfb154fbc11:~/legendary-waddle/trussworks-infrasec/bootstrap$ terraform apply
module.bootstrap.module.terraform_state_bucket.data.aws_caller_identity.current: Refreshing state...
module.bootstrap.module.terraform_state_bucket_logs.data.aws_redshift_service_account.main: Refreshing state...
module.bootstrap.module.terraform_state_bucket_logs.data.aws_elb_service_account.main: Refreshing state...
module.bootstrap.module.terraform_state_bucket_logs.data.aws_caller_identity.current: Refreshing state...
module.bootstrap.module.terraform_state_bucket_logs.data.aws_partition.current: Refreshing state...
module.bootstrap.module.terraform_state_bucket.data.aws_partition.current: Refreshing state...
module.bootstrap.module.terraform_state_bucket.data.aws_iam_policy_document.supplemental_policy: Refreshing state...
module.bootstrap.module.terraform_state_bucket_logs.data.aws_iam_policy_document.main: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.bootstrap.aws_dynamodb_table.terraform_state_lock will be created
  + resource "aws_dynamodb_table" "terraform_state_lock" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "terraform-state-lock"
      + read_capacity    = 2
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Automation" = "Terraform"
          + "Name"       = "terraform-state-lock"
        }
      + write_capacity   = 2

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # module.bootstrap.aws_iam_account_alias.alias will be created
  + resource "aws_iam_account_alias" "alias" {
      + account_alias = "trussworks-infrasec"
      + id            = (known after apply)
    }

  # module.bootstrap.module.terraform_state_bucket.aws_s3_bucket.private_bucket will be created
  + resource "aws_s3_bucket" "private_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "trussworks-infrasec-terraform-state-us-west-2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + aws:SecureTransport = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-us-west-2/*"
                      + Sid       = "enforce-tls-requests-only"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + ArnLike      = {
                              + aws:SourceArn = "arn:aws:s3:::trussworks-infrasec-terraform-state-us-west-2"
                            }
                          + StringEquals = {
                              + aws:SourceAccount = "031479135899"
                              + s3:x-amz-acl      = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "s3.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-us-west-2/*"
                      + Sid       = "inventory-and-analytics"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Automation" = "Terraform"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 14
          + enabled                                = true
          + id                                     = (known after apply)

          + expiration {
              + expired_object_delete_marker = true
            }

          + noncurrent_version_expiration {
              + days = 365
            }

          + noncurrent_version_transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
        }
      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)
          + prefix  = "_AWSBucketInventory/"

          + expiration {
              + days = 14
            }
        }
      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)
          + prefix  = "_AWSBucketAnalytics/"

          + expiration {
              + days = 30
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.bootstrap.module.terraform_state_bucket.aws_s3_bucket_analytics_configuration.private_analytics_config[0] will be created
  + resource "aws_s3_bucket_analytics_configuration" "private_analytics_config" {
      + bucket = "trussworks-infrasec-terraform-state-us-west-2"
      + id     = (known after apply)
      + name   = "Analytics"

      + storage_class_analysis {
          + data_export {
              + output_schema_version = "V_1"

              + destination {
                  + s3_bucket_destination {
                      + bucket_arn = (known after apply)
                      + format     = "CSV"
                      + prefix     = "/_AWSBucketAnalytics"
                    }
                }
            }
        }
    }

  # module.bootstrap.module.terraform_state_bucket.aws_s3_bucket_public_access_block.public_access_block will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.bootstrap.module.terraform_state_bucket_logs.aws_s3_bucket.aws_logs will be created
  + resource "aws_s3_bucket" "aws_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = "log-delivery-write"
      + arn                         = (known after apply)
      + bucket                      = "trussworks-infrasec-terraform-state-logs-us-west-2"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2"
                      + Sid       = "cloudtrail-logs-get-bucket-acl"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "cloudtrail.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/cloudtrail/AWSLogs/031479135899/*"
                      + Sid       = "cloudtrail-logs-put-object"
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "logs.us-west-2.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2"
                      + Sid       = "cloudwatch-logs-get-bucket-acl"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "logs.us-west-2.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/cloudwatch/*"
                      + Sid       = "cloudwatch-logs-put-object"
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2"
                      + Sid       = "config-permissions-check"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "config.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/config/AWSLogs/031479135899/Config/*"
                      + Sid       = "config-bucket-delivery"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "arn:aws:iam::797873946194:root"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/elb/AWSLogs/031479135899/*"
                      + Sid       = "elb-logs-put-object"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "arn:aws:iam::797873946194:root"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/alb/AWSLogs/031479135899/*"
                      + Sid       = "alb-logs-put-object"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Condition = {
                          + StringEquals = {
                              + s3:x-amz-acl = "bucket-owner-full-control"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/nlb/AWSLogs/031479135899/*"
                      + Sid       = "nlb-logs-put-object"
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Deny"
                      + Principal = {
                          + Service = "delivery.logs.amazonaws.com"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2"
                      + Sid       = "nlb-logs-acl-check"
                    },
                  + {
                      + Action    = "s3:PutObject"
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "arn:aws:iam::902366379725:user/logs"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/redshift/*"
                      + Sid       = "redshift-logs-put-object"
                    },
                  + {
                      + Action    = "s3:GetBucketAcl"
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "arn:aws:iam::902366379725:user/logs"
                        }
                      + Resource  = "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2"
                      + Sid       = "redshift-logs-get-bucket-acl"
                    },
                  + {
                      + Action    = "s3:*"
                      + Condition = {
                          + Bool = {
                              + aws:SecureTransport = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2/*",
                          + "arn:aws:s3:::trussworks-infrasec-terraform-state-logs-us-west-2",
                        ]
                      + Sid       = "enforce-tls-requests-only"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Automation" = "Terraform"
          + "Name"       = "trussworks-infrasec-terraform-state-logs-us-west-2"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = "expire_all_logs"
          + prefix  = "/*"

          + expiration {
              + days = 90
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.bootstrap.module.terraform_state_bucket_logs.aws_s3_bucket_public_access_block.public_access_block[0] will be created
  + resource "aws_s3_bucket_public_access_block" "public_access_block" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.bootstrap.aws_iam_account_alias.alias: Creating...
module.bootstrap.module.terraform_state_bucket_logs.aws_s3_bucket.aws_logs: Creating...
module.bootstrap.aws_dynamodb_table.terraform_state_lock: Creating...
module.bootstrap.aws_iam_account_alias.alias: Creation complete after 1s [id=trussworks-infrasec]
module.bootstrap.module.terraform_state_bucket_logs.aws_s3_bucket.aws_logs: Creation complete after 6s [id=trussworks-infrasec-terraform-state-logs-us-west-2]
module.bootstrap.module.terraform_state_bucket_logs.aws_s3_bucket_public_access_block.public_access_block[0]: Creating...
module.bootstrap.module.terraform_state_bucket.aws_s3_bucket.private_bucket: Creating...
module.bootstrap.module.terraform_state_bucket_logs.aws_s3_bucket_public_access_block.public_access_block[0]: Creation complete after 0s [id=trussworks-infrasec-terraform-state-logs-us-west-2]
module.bootstrap.aws_dynamodb_table.terraform_state_lock: Creation complete after 9s [id=terraform-state-lock]
module.bootstrap.module.terraform_state_bucket.aws_s3_bucket.private_bucket: Creation complete after 6s [id=trussworks-infrasec-terraform-state-us-west-2]
module.bootstrap.module.terraform_state_bucket.aws_s3_bucket_public_access_block.public_access_block: Creating...
module.bootstrap.module.terraform_state_bucket.aws_s3_bucket_analytics_configuration.private_analytics_config[0]: Creating...
module.bootstrap.module.terraform_state_bucket.aws_s3_bucket_analytics_configuration.private_analytics_config[0]: Creation complete after 0s [id=trussworks-infrasec-terraform-state-us-west-2:Analytics]
module.bootstrap.module.terraform_state_bucket.aws_s3_bucket_public_access_block.public_access_block: Creation complete after 0s [id=trussworks-infrasec-terraform-state-us-west-2]

Apply complete! Resources: 7 added, 0 changed, 0 destroyed.
```